Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/adoption_and_fostering/tracing_your_birth_family.html.txt.tmx
Source language: en
Languages: ga

source: There is also provision that requires the Registrar General to keep an index
ga: Níl aon fhoráil ann a cheanglaíonn ar an Ard-Chláraitheoir chun innéacs a choimeád

source: This index allows for connections between each entry in the Adopted Children Register and the Register of Births to be traced
ga: Ceadaíonn an t-innéacs seo naisc a dhéanamh idir gach iontráil i gClár na Leanaí Uchtaithe agus i gClár na mBreitheanna a rianú

source: This means that details of an adopted child's birth parents can be traced back to the Register of Births
ga: Ciallaíonn seo gur féidir sonraí faoi thuismitheoirí breithe linbh uchtaithe a rianú siar chuig Clár na mBreitheanna

source: Due to the sensitive nature of this information, this index is not available to the public and you must apply to the Adoption Authority to get access
ga: Mar gheall ar chineál íogair na faisnéise seo, níl an t-innéacs seo ar fáil don phobal agus ní mór duit iarratas a dhéanamh ar an Údarás Uchtála chun rochtain a fháil

source: You may have been trying to get a copy of your original birth certificate without success
ga: D’fhéadfadh go raibh iarracht á déanamh agat chun cóip a fháil de do bhunteastas breithe agus nár éirigh leat

source: Generally, the certificate can only be released if the consent of the birth mother has been obtained
ga: Go ginearálta, ní féidir scaoileadh leis an teastas ach amháin má fuarthas toiliú na máthar breithe

source: However, if you have tried and failed to find your mother, if she is dead or if she refuses to give her consent, you have the option of applying to the Adoption Authority
ga: Má rinne tú iarracht agus má theip ort do mháthair a aimsiú, má fuair sí bás nó má dhiúltaíonn sí chun a toiliú a thabhairt, áfach, tá an rogha agat iarratas a dhéanamh ar an Údarás Uchtála

source: It will review your case and decide whether or not to give you the information you need to get a copy of your birth certificate from the Registrar General
ga: Déanfaidh siad athbhreithniú ar do chás agus an cinneadh ar cibé acu an fhaisnéis a thabhairt nó gan í a thabhairt a theastaíonn uait chun cóip de do theastas breithe a fháil ón Ard-Chláraitheoir

source: The Adoption Authority's first step is generally to go to the adoption society or HSE Area responsible for the placement
ga: Is gnách gurb é an chéad rud a dhéanann an tÚdarás Uchtála ná dul i gcomhairle leis an gcumann uchtála nó Limistéar FSS atá freagrach as an gcur i gcúram

source: The Authority will make sure that everything possible is done to locate your birth mother, and it will look for details of the counselling you were given by the agency as to what you should do with the information contained on your birth certificate
ga: Cinnteoidh an tÚdarás go ndéantar gach rud is féidir chun do mháthair bhreithe a aimsiú, agus cuardóidh siad sonraí faoin gcomhairleoireacht a chuir an ghníomhaireacht ort maidir lenar cheart duit a dhéanamh leis an bhfaisnéis a chuimsítear i do theastas breithe

source: It is possible that the certificate will give an address or some identifying detail for your birth mother, and the Authority is obligated to safeguard her privacy
ga: D’fhéadfadh go luafar sa teastas seoladh nó sonraí áirithe aitheantais i dtaobh do mháthar, agus tá dualgas ar an Údarás a príobháideacht a chosaint

source: The adoption society or HSE Area must prepare a report containing all the relevant information about your case and pass it on to the Adoption Authority
ga: Ní mór don chumann uchtála nó Limistéar FSS tuarascáil a chur le chéile ina gcuimsítear an fhaisnéis ábhartha go léir maidir le do chás agus an tuarascáil a sheoladh ar aghaidh chuig an Údarás Uchtála

source: Based on this information, the Authority will make their decision as to whether or not the relevant information should be made available to you
ga: Bunaithe ar an bhfaisnéis seo, déanfaidh an tÚdarás Uchtála a gcinneadh maidir le cibé acu ar cheart nó nár cheart an fhaisnéis ábhartha a chur ar fáil duit

source: If you have gone through this process and the Adoption Authority has refused you access to the information relating to your case, you can make an application to the High Court for a judicial review of the Authority's decision
ga: Má ghabh tú tríd an bpróiseas seo agus má dhiúltaigh an tÚdarás Uchtála rochtain a thabhairt duit ar an bhfaisnéis a bhaineann le do chás, féadfaidh tú iarratas a dhéanamh ar an Ard-Chúirt ar athbhreithniú breithiúnach a dhéanamh ar chinneadh an Údaráis

source: However, this is an expensive process
ga: Próiseas costasach atá ann seo, áfach

source: Depending on the adoption agency involved, you may be asked to pay a fee for the tracing of a birth family member
ga: Ag brath ar an ngníomhaireacht uchtála a bhíonn i gceist, b’fhéidir go n-iarrfar ort táille a íoc as duine muinteartha breithe a rianú

source: The fee varies from agency to agency but is generally in the region of €50
ga: Is éagsúil a bhíonn an táille ó ghníomhaireacht go gníomhaireacht, ach is gnách gurb ionann í agus thart ar €50

source: This fee goes towards the costs of phone calls, travelling and other costs that are incurred during the search
ga: Cuirtear an táille seo i dtreo chostais ghlaonna gutháin, taistil srl, a thabhaítear i rith an chuardaigh

source: Some agencies do not charge any fee but they may accept donations
ga: Ní ghearrfaidh roinnt gníomhaireachtaí aon táille ach féadfaidh siad glacadh le tabhartais

source: In that case, anything you give is up to you
ga: Sa chás sin, is fútsa atá sé aon rud a thabhairt

source: If you know the name of the adoption agency responsible for your placement, you should contact it first
ga: Más eol duit ainm na gníomhaireachta uchtála atá freagrach as thú a chur i gcúram, ba cheart duit teagmháil a dhéanamh leo ar dtús

source: Details of former health boards and adoption societies are available from the Adoption Authority
ga: Tá fáil ar shonraí faoi iar-bhoird sláinte agus iar-chumainn uchtála ón Údarás Uchtála

source: If you do not know the name of the adoption society or former health board that dealt with your case, you should write to the Adoption Authority, enclosing your details and ask it for the name of the relevant agency
ga: Murab eol duit ainm an iar-chumainn uchtála nó an iar-bhoird sláinte a dhéileáil le do chás, ba cheart duit scríobh chuig an Údarás Uchtála, do shonraí a chur faoi iamh agus iarraidh orthu ainm na gníomhaireachta cuí a thabhairt duit

source: If you are trying to trace your birth family or child, and are unhappy with the help you are getting from your adoption agency, you can make a complaint to the Adoption Authority
ga: Má tá iarrachtaí á ndéanamh agat chun do theaghlach breithe nó do leanbh a rianú, agus mura bhfuil tú sásta leis an gcabhair atá á fáil agat ó do ghníomhaireacht uchtála, féadfaidh tú gearán a dhéanamh leis an Údarás Uchtála

source: You can download tracing guides for adopted people and birth parents/family on Adoption Rights Alliance's website
ga: Féadfaidh tú treoracha rianaithe a íoslódáil do dhaoine uchtaithe agus do thuismitheoirí/theaghlach breithe ar láithreán gréasáin an Chomhaontais um Chearta Uchtála

source: Information in relation to tracing for adopted people, birth parents and adoptive parents is available on the Council of Irish Adoption Agencies website. Where to apply Adoption Authority of Ireland Shelbourne House Shelbourne Road Ballsbridge Dublin 4 Ireland Tel:(01) 230 9300 Homepage: https://www.aai.gov.ie/ Contact Form: https://www.aai.gov.ie/contact-us.html General Register Office Government Offices Convent Road Roscommon Ireland Tel:+353 90 663 2900 Locall:1890 25 20 76 Fax:+353 90 663 2999 Homepage: http://www.welfare.ie/en/Pages/General-Register-Office.aspx Email: gro@groireland.ie Barnardos Post Adoption Service Barnardos Hyde Square 654 South Circular Road Dublin 8 Ireland Tel:Helpline (01) 454 6388 10am-1pm, Tuesday & Thursday Homepage: http://www.barnardos.ie/what-we-do/specialist-services/adoption.html Email: adoption@barnardos.ie Adoption Rights Alliance The Mill House Millview Road Malahide Dublin Ireland Tel:+353 (0)86 235 9127 Homepage: http://www.adoptionrightsalliance.com/ Email: info@adoptionrightsalliance.com Adoptive Parents Association of Ireland Ms. Helen Gilmartin Roundwood Bray Co
ga: Tá fáil ar fhaisnéis maidir le rianú a dhéanamh ar dhaoine uchtaithe, tuismitheoirí breithe agus tuismitheoirí uchtála ar fáil ar láithreán gréasáin Chomhairle Chumainn Uchtála na hÉireann
